#+TITLE: Dropbox Notes
#+date: 2025:May:1

* Tray Icon
All of the configuration of Dropbox is done through the GUI which I only have been able to access by right clicking the Tray Icon in the top bar.

To see Dropbox settings, one may need to =dropbox stop= and =dropbox start=  manually in terminal to for it to appear in the top bar to be right clicked.

** Needed extension to see legacy icons (Fedora 41, 2025/05/01)
Source: [[https://extensions.gnome.org/extension/615/appindicator-support/][extensions.gnome.org]] or [[https://extensions.gnome.org/away/https%253A%252F%252Fgithub.com%252Fubuntu%252Fgnome-shell-extension-appindicator][github]]
- I just tuned the extension on through the extensions web interface in the first link above

** Warning updates to ensure able 2025/05/01
#+begin_quote 
Dropbox can't load the =libappindicator= library for the tray icon. Starting May 27, 2025, Dropbox updates will need this library. To avoid interruptions, install the library.
#+end_quote

Installing libappindicator stopped the warning
#+begin_src shell
dnf install libappindicator
#+end_src


* Dropbox as a systemd service
# Last used for Fedora 37 (does not seem to be needed for Fedora 41)

Source: https://www.bbkane.com/blog/dropbox-as-a-systemd-service/

** Tangle the following
Write the following to =~/.config/systemd/user/dropbox.service=
#+begin_src shell :tangle  ~/.config/systemd/user/dropbox.service :mkdirp yes
[Unit]
Description=Dropbox as a user service
After=local-fs.target network.target

[Service]
Type=simple
ExecStart=%h/.dropbox-dist/dropboxd
Restart=on-failure
RestartSec=1
# Note: don't set these in user mode- they're already set, and
# systemd won't have permission to set them- killing your service before
# it starts
# User=%U
# Group=%U

[Install]
WantedBy=default.target
#+end_src

** Start the service
#+begin_src shell
systemctl --user start dropbox
#+end_src

#+RESULTS:

** Make sure it worked with:
#+begin_src shell :results output code
7systemctl --user status dropbox.service
#+end_src

** Check the logs
In my (limited) experience, Dropbox tends to be a quiet service, as checking the logs with journalctl doesn't really produce much
#+begin_src shell
journalctl -u dropbox
#+end_src

#+RESULTS:
: -- No entries --

** Finally, make sure the service starts on login
#+begin_src shell
systemctl --user enable dropbox
#+end_src

#+RESULTS:
